tap "adoptopenjdk/openjdk"
tap "filosottile/musl-cross"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "mongodb/brew"
tap "superfly/tap"
# Run your GitHub Actions locally 🚀
brew "act"
# ARP scanning and fingerprinting tool
brew "arp-scan"
# Shell extension to jump to frequently used directories
brew "autojump"
# Client for Amazon Elastic Beanstalk web service
brew "aws-elasticbeanstalk"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Official Amazon AWS command-line interface
brew "awscli"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Fancy interface to the Python interpreter
brew "bpython"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Cross-platform make
brew "cmake"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# GitHub command-line tool
brew "gh"
# Platform built on V8 to build network applications
brew "node"
# Interactive command-line tool for using emoji in commit messages
brew "gitmoji", link: false
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Improved top (interactive process viewer)
brew "htop"
# Simple zero-configuration command-line HTTP server
brew "http-server"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Bare libuv bindings for lua
brew "luv"
# Security and system auditing tool to harden systems
brew "lynis"
# Utility for directing compilation
brew "make"
# Drop-in replacement for MySQL
brew "mariadb"
# Run a Kubernetes cluster locally
brew "minikube"
# Platform built on V8 to build network applications
brew "node@14"
# MongoDB Shell to connect, configure, query, and work with your MongoDB database
brew "mongosh"
# Open source relational database management system
brew "mysql", restart_service: true, link: false
# NCurses Disk Usage
brew "ncdu"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Realtime console network usage monitor
brew "nload"
# Manage multiple Node.js versions
brew "nvm"
# Optimized BLAS library
brew "openblas"
# Cross-platform library for audio I/O
brew "portaudio"
# File browser
brew "ranger"
# Persistent key-value database, with built-in net interface
brew "redis"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Terminal-based client for Spotify
brew "spotify-tui"
# Spotify daemon
brew "spotifyd", restart_service: true
# Feature-rich console based todo list manager
brew "task"
# User interface to the TELNET protocol
brew "telnet"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Programmatically correct mistyped console commands
brew "thefuck"
# Terminal multiplexer
brew "tmux"
# Program that allows you to count code, quickly
brew "tokei"
# CLI tool that moves files or folder to the trash
brew "trash"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# Access X11 clipboards from the command-line
brew "xclip"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Centralized server for distributed coordination of services
brew "zookeeper"
# UNIX shell (command interpreter)
brew "zsh"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
brew "superfly/tap/flyctl"
# AdoptOpenJDK OpenJDK (Java) Development Kit
cask "adoptopenjdk15"
# Browser for SQLite databases
cask "db-browser-for-sqlite"
# Monospaced font that includes programming ligatures
cask "font-cascadia-code"
cask "font-fira-code"
cask "font-hack-nerd-font"
# Tool to prevent the system from going into sleep mode
cask "keepingyouawake"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Spreadsheet software
cask "microsoft-excel"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Explore and manipulate your MongoDB data
cask "mongodb-compass"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# App to write, plan, collaborate, and get organized
cask "notion"
# Administration and development platform for PostgreSQL
cask "pgadmin4"
# Collaboration platform for API development
cask "postman"
# Archive manager for data compression and backups
cask "rar"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Messaging app with a focus on speed and security
cask "telegram"
# Multimedia player
cask "vlc"
